`timescale 1ns / 1ps

// 1. Модуль без портів
module tb_SPI;

    // 2. Змінні для керування (reg для входів, wire для виходів)
    reg tb_clk;
    reg tb_rst;
    reg tb_CLK_ext;
    reg tb_MOSI;
    reg tb_CS;
    
    wire tb_MISO;

    // 3. Підключення нашої мікросхеми (DUT - Device Under Test)
    SPI my_spi_module (
        .clk(tb_clk),
        .rst(tb_rst),
        .CLK(tb_CLK_ext),
        .MOSI(tb_MOSI),
        .CS(tb_CS),
        .MISO(tb_MISO)
    );

    // 4. Генератор системної частоти 50 МГц (період 20 нс)
    // Цей блок працює паралельно і нескінченно
    always begin
        tb_clk = 1'b0;
        #10;            // Чекаємо 10 наносекунд
        tb_clk = 1'b1;
        #10;            // Чекаємо ще 10 наносекунд
    end

    // 5. Сценарій тестування (виконується послідовно 1 раз!)
integer i;
    reg [7:0] send_data = 8'b11001010; // Цей байт (0xCA) ми "відправимо" з STM32

    // 5. Сценарій тестування
    initial begin
        $dumpfile("dump.vcd"); 
        $dumpvars(0, tb_SPI);  
        
        // --- 1. Ініціалізація ---
        tb_rst = 1'b0;     // Скидання активне
        tb_CLK_ext = 1'b0; // CPOL = 0
        tb_MOSI = 1'b0;
        tb_CS = 1'b1;      // CS неактивний (високий)
        
        #50;
        tb_rst = 1'b1;     // Знімаємо ресет
        #100;
        
        // --- 2. Імітація передачі від STM32 ---
        
        tb_CS = 1'b0;      // STM32 опускає CS (початок передачі)
        #200;              // Трохи чекаємо перед першим тактом
        
        // Цикл від 7 до 0 (MSB First - старший біт іде першим)
        for (i = 7; i >= 0; i = i - 1) begin
            tb_MOSI = send_data[i]; // Виставляємо поточний біт на лінію
            #200;                   // Чекаємо (Setup time)
            
            tb_CLK_ext = 1'b1;      // Передній фронт (ПЛІС має зчитати тут!)
            #500;                   // Тримаємо лінію в 1 (половина періоду 1 МГц)
            
            tb_CLK_ext = 1'b0;      // Задній фронт
            #300;                   // Тримаємо лінію в 0
        end
        
        #200;
        tb_CS = 1'b1;      // Піднімаємо CS (кінець передачі)
        
        // --- 3. Зупинка ---
        #1000;
        $finish;
    end

endmodule